Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: This loads all the runtime extension dependencies, as well as other user dependencies (note that this may include duplicate copies of classes also loaded by the Augment ClassLoader). It does not load the application root or any hot deployed code. This ClassLoader is persistent, even if the application restarts it will remain (which is why it cannot load application classes that may be hot deployed). Its parent is the base ClassLoader.
ja_jp: これは、他のユーザー依存関係と同様に、すべてのランタイムエクステンション依存関係をロードします(これには 拡張 ClassLoader によってロードされたクラスの重複コピーも含まれる可能性があることに注意してください)。アプリケーションのルートやホットデプロイされたコードはロードされません。この ClassLoader は永続的なもので、アプリケーションが再起動しても残ります (ホットデプロイされている可能性のあるアプリケーションクラスをロードできないのはそのためです)。親はベース ClassLoader です。

source: This loads all the runtime extension dependencies, as well as other user dependencies (note that this may include duplicate copies of classes also loaded by the Augmentation ClassLoader). It does not load the application root or any hot deployed code. This ClassLoader is persistent, even if the application restarts it will remain (which is why it cannot load application classes that may be hot deployed). Its parent is the base ClassLoader.
ja_jp: これは、すべてのランタイム・エクステンションの依存関係、およびその他のユーザー依存関係をロードします（これには、オーグメンテーション・クラスローダーによってもロードされたクラスの重複コピーが含まれる可能性があることに注意してください）。 アプリケーション・ルートやホット・デプロイされたコードはロードしません。 このClassLoaderは永続的で、アプリケーションが再起動しても残ります（そのため、ホット・デプロイされたアプリケーション・クラスをロードすることはできません）。このClassLoaderの親はベースClassLoaderです。

source: This loads code that is not hot-reloadable, but it does support transformation (although once the class is loaded this transformation is no longer possible). This means that only transformers registered in the first application start will take effect, however as these transformers are expected to be idempotent this should not cause problems. An example of the sort of transformation that might be required here is a Panache entity packaged in an external jar. This class needs to be transformed to have its static methods implemented, however this transformation only happens once, so restarts use the copy of the class that was created on the first start.
ja_jp: これはホットリロードできないコードをロードしますが、変換をサポートしています (ただし、クラスがロードされるとこの変換はできなくなります)。これは、最初のアプリケーション起動時に登録された Transformer のみが有効になることを意味しますが、これらの Transformer は冪等であることが期待されているため、これは問題を引き起こすことはないはずです。ここで必要となる可能性のある変換の例として、外部 jar にパッケージ化された Panache エンティティーがあります。このクラスは静的メソッドを実装するために変換する必要がありますが、この変換は一度しか行われないため、再起動時には最初の起動時に作成されたクラスのコピーを使用します。

source: This log handler is a java.util.LogHandler which takes the LogRecord object as a parameter of the publish method which will be called when writing a log in an application. For example like log.info(“I Love Open Source!”);. If configured correctly, this log handler will be called when writing logs. As we want to put the log messages in AWS CloudWatch, we need to add the logic for doing it. Therefore we create an InputLogEvent and call _putLogEvents()_ which puts the log message to CloudWatch. That’s basically it.
ja_jp: このログハンドラは、java.util.LogHandlerであり、アプリケーションでログを書き込む際に呼び出されるpublishメソッドのパラメータとしてLogRecordオブジェクトを受け取ります。例えば、log.info("I Love Open Source!"); のようになります。正しく設定されていれば、このログハンドラはログを書き込むときに呼び出されます。AWS CloudWatchにログメッセージを出力したいので、そのためのロジックを追加する必要があります。そこで、InputLogEventを作成し、ログメッセージをCloudWatchに置く _putLogEvents()_を呼び出しています。基本的にはこれで終わりです。

source: This login page is also displayed if you navigate to authenticated request path during the development of the xref:security-oidc-code-flow-authentication.adoc[Quarkus OIDC web application]. As always, the default roles for `alice` are `admin` and `user`, while the roles for `bob` are just `user`. You can configure those built-in roles if required:
ja_jp: このログインページは、xref:security-oidc-code-flow-authentication.adoc[Quarkus OIDC Web アプリケーション] の開発中に認証されたリクエストパスに移動した場合にも表示されます。 いつものように、`alice` のデフォルトのロールは `admin` と `user` ですが、`bob` のロールは `user` のみです。 必要に応じて、これらの組み込みロールを設定できます。

source: This logout request starts an https://openid.net/specs/openid-connect-session-1_0.html#RPLogout[RP-initiated logout]. The user will be redirected to the OIDC provider to log out, where they can be asked to confirm the logout is indeed intended.
ja_jp: このログアウトリクエストは、 https://openid.net/specs/openid-connect-session-1_0.html#RPLogout[RP-initiated ログアウト] を開始します。 ユーザはログアウトするために OIDC プロバイダーにリダイレクトされ、そこでログアウトが本当に意図されたものであるか確認されます。

source: This logout request will start an https://openid.net/specs/openid-connect-session-1_0.html#RPLogout[RP-Initiated Logout] and the user will be redirected to the OpenID Connect Provider to logout where a user may be asked to confirm the logout is indeed intended.
ja_jp: このログアウト要求により、 https://openid.net/specs/openid-connect-session-1_0.html#RPLogout[RP-Initiated Logout] が開始され、ユーザーは OpenID Connect Provider にリダイレクトされ、そこでログアウトできます。ログアウトが実際に意図されていることを確認するように求められます。

source: This macro creates an URL with a name automatically sourced from the anchored heading, section, or table.
ja_jp: このマクロは、アンカーされた見出し、セクション、または表から自動的に取得された名前を指定して URL を作成します。

source: This main class will bootstrap Quarkus and run it until it stops. This is no different to the automatically generated main class, but has the advantage that you can just launch it directly from the IDE without needing to run a Maven or Gradle command.
ja_jp: このメインクラスはQuarkusを起動し、停止するまで実行します。これは自動生成されたメインクラスと変わりませんが、MavenやGradleのコマンドを実行する必要がなく、IDEから直接起動するだけで済むという利点があります。

source: This makes sense; you've disabled the database Dev Service, but you haven't started your own database.
ja_jp: これは理にかなっています。データベースの Dev Service を無効にしましたが、 独自のデータベースを起動していません。

source: This means in particular that the configuration property <<quarkus-hibernate-search-orm-elasticsearch_quarkus-hibernate-search-orm-indexing-plan-synchronization-strategy,`quarkus.hibernate-search-orm.indexing.plan.synchronization.strategy`>> cannot be set when using the `outbox-polling` coordination strategy: Hibernate Search will always behave as if this property was set to `write-sync` (the default).
ja_jp: これは、 `outbox-polling` 調整ストラテジーを使用している場合に設定プロパティー <<quarkus-hibernate-search-orm-elasticsearch_quarkus-hibernate-search-orm-indexing-plan-synchronization-strategy,`quarkus.hibernate-search-orm.indexing.plan.synchronization.strategy`>> を設定できないことを意味します。 Hibernate Search は常に、このプロパティーが `write-sync` (デフォルト) に設定されているかのように動作します。

source: This means in particular that the configuration property link:#quarkus-hibernate-search-orm-elasticsearch_quarkus.hibernate-search-orm.automatic-indexing.synchronization.strategy[`quarkus.hibernate-search-orm.automatic-indexing.synchronization.strategy`] cannot be set when using the `outbox-polling` coordination strategy: Hibernate Search will always behave as if this property was set to `write-sync` (the default).
ja_jp: これは特に `outbox-polling` 調整ストラテジーを使用している場合に設定プロパティ link:#quarkus-hibernate-search-orm-elasticsearch_quarkus.hibernate-search-orm.automatic-indexing.synchronization.strategy[`quarkus.hibernate-search-orm.automatic-indexing.synchronization.strategy`] を設定できないことを意味しています。Hibernate Searchは、このプロパティが常に `write-sync` (デフォルトの値)に設定されているかのように動作します。

source: This means that Cloud Build is not activated yet. To overcome this error, open the URL shown in the error, follow the instructions and then wait a few minutes before retrying the command.
ja_jp: これは、Cloud Build がまだ有効化されていないことを意味します。このエラーを解決するには、エラーに表示されている URL を開き指示に従った後、数分待ってからコマンドを再試行してください。

source: This means that after we identify the trace and span IDs of interest from the UI provided by the OpenTelemetry implementation, we can immediately jump to the details in JFR using those IDs.
ja_jp: つまり、OpenTelemetry 実装によって提供される UI から対象のトレース ID とスパン ID を特定した後、それらの ID を使用して JFR 内の詳細にすぐに移動できます。

source: This means that any static variables initialized inline, or initialized in a static block, will keep the same value even if the application is restarted. This is a different behaviour compared to what would happen if executed as Java.
ja_jp: つまり、インラインで初期化されたスタティック変数や、スタティックブロックで初期化されたスタティック変数は、アプリケーションを再起動しても同じ値を維持します。これは、Javaとして実行した場合とは異なる動作です。

source: This means that if you want to build images for more than one platform at a time (i.e. `quarkus.docker.buildx.platform=linux/amd64,linux/arm64`), you need to push the images (`quarkus.container-image.push=true`) directly as part of the build process. Docker buildx does not support loading into the local registry when building multi-platform images.
ja_jp: つまり、一度に複数のプラットフォーム用のイメージをビルドしたい場合（例： `quarkus.docker.buildx.platform=linux/amd64,linux/arm64` ）、ビルドプロセスの一部としてイメージ（ `quarkus.container-image.push=true` ）を直接プッシュする必要があります。Docker buildxはマルチプラットフォームイメージのビルド時にローカルレジストリへのロードをサポートしていません。

source: This means that metadata is only processed once at build time, which both saves on startup time, and also on memory usage as the classes etc that are used for processing are not loaded (or even present) in the runtime JVM.
ja_jp: これは、メタデータがビルド時に一度だけ処理されることを意味し、起動時間の節約と、 処理に使用されるクラスなどがランタイムJVMにロードされない (あるいは存在しない) ため、メモリー使用量の節約の両方を実現しています。

source: This means that requests with an invalid credential will always be rejected, even for public pages. You can change this behavior and only authenticate when required by setting `quarkus.http.auth.proactive=false`.
ja_jp: これは、公開ページであっても、無効なクレデンシャルを持つリクエストは常に拒否されることを意味します。この動作を変更して、 `quarkus.http.auth.proactive=false` を設定することで必要な場合のみ認証を行うことができます。

source: This means that we wait for the entities to be searchable before considering a write complete. On a production setup, the `write-sync` default will provide better performance. Using `sync` is especially important when testing as you need the entities to be searchable immediately.
ja_jp: これは、エンティティが検索可能になるのを待ってから書き込みが完了したとみなすことを意味します。本番環境では、デフォルトの `write-sync` の方がパフォーマンスが高くなります。テスト時にはエンティティがすぐに検索可能になる必要があるため `sync` を使用することが特に重要です。

source: This means the entity can be loaded without querying the database, but be careful as it implies the loaded entity might not reflect recent changes in the database.
ja_jp: これは、データベースに問い合わせることなくエンティティをロードできることを意味しますが、ロードされたエンティティがデータベースの最近の変更を反映していない可能性があることを意味するので注意が必要です。

source: This means you can use your favorite logging API with Quarkus, providing you add the <<logging-apis,appropriate adapter>> to your application:
ja_jp: これは、アプリケーションに <<logging-apis,適切なアダプター>> を追加すれば、Quarkus でお好みのロギング API を使用できることを意味します。

source: This mechanism uses the Vert.x EventBus, so you need to enable the `vertx` extension to use this feature. If you are creating a new project, set the `extensions` parameter are follows:
ja_jp: この仕組みはVert.x EventBusを利用しているので、この機能を利用するには `vertx` エクステンションを有効にする必要があります。新規プロジェクトを作成する場合は、 `extensions` パラメーターを以下のように設定します。

source: This mechanism uses the Vert.x EventBus, so you need to enable the `vertx` extension to use this feature. If you are creating a new project, set the `extensions` parameter as follows:
ja_jp: このメカニズムは Vert.x EventBus を使用するため、この機能を使用するには `vertx` エクステンションを有効にする必要があります。 新しいプロジェクトを作成する場合は、 `extensions` パラメータを次のように設定します：

source: This message could be used in a template via `{Controller_index:hello(name)}`.
ja_jp: このメッセージは `{Controller_index:hello(name)}` 経由でテンプレートで使用できます。

source: This metadata can be provided in two ways: either as part of the JReleaser plugin's configuration or using standard POM elements. If you choose the former option then the plugin's configuration may look like this:
ja_jp: このメタデータは、JReleaser プラグインの設定の一部として、または標準の POM 要素を使用して 2 つの方法で提供できます。前者のオプションを選択した場合、プラグインの設定は次のようになります。

source: This method (not provided in this example) would generate the class using the ASM API.
ja_jp: このメソッド (この例では提供されていません) は、ASM API を使用してクラスを生成します。

source: This method adds a new class file to the deployment. The source that is used will be the original source that is part of the current project.
ja_jp: このメソッドは、デプロイメントに新しいクラスファイルを追加します。使用されるソースは、現在のプロジェクトの一部である元のソースになります。

source: This method adds a new static resource
ja_jp: このメソッドは新しい静的リソースを追加します

source: This method allows us to add users while hashing the password with the proper bcrypt hash.
ja_jp: この方法では、パスワードを適切なbcryptハッシュでハッシュしながらユーザーを追加することができます。

source: This method allows you to add users while hashing passwords with the proper `bcrypt` hash.
ja_jp: このメソッドでは、パスワードを適切な `bcrypt` ハッシュでハッシュ化しながらユーザーを追加することができます。

source: This method allows you to modify the source of a class file. The old source is passed into the function, and the updated source is returned.
ja_jp: このメソッドを使用すると、クラスファイルのソースを変更できます。古いソースが関数に渡され、更新されたソースが返されます。

source: This method can be used for any normal scoped CDI bean (e.g. `@ApplicationScoped`, `@RequestScoped` etc, basically every scope except `@Singleton` and `@Dependent`).
ja_jp: この方法は、通常のスコープ付き CDI Bean (例: `@ApplicationScoped`、 `@RequestScoped` など、 `@Singleton` と `@Dependent` 以外の基本的にすべてのスコープ) に対して使用することができます。

source: This method can be used to force a refresh of the cache entry corresponding to the given key.
ja_jp: このメソッドを使用して、指定されたキーに対応するキャッシュエントリーを強制的に更新することができます。

source: This method directly invokes the health check Servlet and verifies the response
ja_jp: このメソッドは、ヘルスチェックサーブレットを直接呼び出し、応答を検証します。

source: This method is called when a client disconnects. The method uses the `WebSocketConnection` to broadcast a message to all remaining connected clients.
ja_jp: このメソッドは、クライアントが切断されたときに呼び出されます。このメソッドは、`WebSocketConnection` を使用して、接続されている残りのすべてのクライアントにメッセージをブロードキャストします。

source: This method is called when a client sends a message. The `broadcast = true` attribute indicates that the returned message should be sent to all connected clients. Here, we just returns the received (text) message.
ja_jp: このメソッドは、クライアントがメッセージを送信するときに呼び出されます。`broadcast = true` 属性は、返されたメッセージが接続されているすべてのクライアントに送信される必要があることを示します。ここでは、受信した (テキスト) メッセージのみを返します。

source: This method is called when a new client connects. The `broadcast = true` attribute indicates that the returned message should be sent to all connected clients.
ja_jp: このメソッドは、新しいクライアントが接続したときに呼び出されます。`broadcast = true` 属性は、返されたメッセージが接続されているすべてのクライアントに送信される必要があることを示します。

source: This method is less flexible because it requires the remote JMX port number to be known at build time, and it requires the application to be rebuilt and redeployed.
ja_jp: この方法は、ビルド時にリモートのJMXポート番号を知っている必要があり、アプリケーションを再構築して再デプロイする必要があるため、柔軟性に欠けます。

source: This method is notified when a `TaskCompleted` event is fired.
ja_jp: このメソッドは、 `TaskCompleted` イベントが発生したときに通知されます。

source: This method lets you add users while hashing passwords with the proper `bcrypt` hash.
ja_jp: この方法では、適切な `bcrypt` ハッシュでパスワードをハッシュしながらユーザーを追加することができます。

source: This method matches an expression with base object of the type `BigDecimal.class`, with the `scale()`/`setScale()` virtual method name and two virtual method parameters - `scale` and `mode`.
ja_jp: このメソッドは、型 `BigDecimal.class` のベースオブジェクトを持つ式に一致し、`scale()`/`setScale()` 仮想メソッド名と、`scale` および `mode` という 2 つの仮想メソッドパラメーターを持ちます。

source: This method matches an expression with base object of the type `BigDecimal.class`, with the `scale` virtual method name and two virtual method parameters.
ja_jp: このメソッドは、 `BigDecimal.class` 型の基底オブジェクトと、 `scale` の仮想メソッド名と 2 つの仮想メソッドパラメーターを持つ式にマッチします。

source: This method matches an expression with base object of the type `Item.class` and the `discountedPrice` property name.
ja_jp: このメソッドは、 `Item.class` 型のベース・オブジェクトと `discountedPrice` プロパティー名を持つ式にマッチします。

source: This method modifies a static resource
ja_jp: このメソッドは静的リソースを変更します

source: This method returns a `Response` and not a list of `Legume`.
ja_jp: このメソッドは `Legume` のリストではなく `Response` を返ます。

source: This method returns the `Uni<String>` type which is non-blocking.
ja_jp: このメソッドは、ノンブロッキングである `Uni<String>` タイプを返します。

source: This method runs on a worker thread despite the signature. The `@Transactional` annotation configures the dispatching strategy to use a worker thread.
ja_jp: このメソッドは、シグネチャにもかかわらず、ワーカースレッドで実行されます。 `@Transactional` アノテーションにより、ワーカースレッドを使用するディスパッチ戦略が設定されています。

source: This method runs on the I/O thread, which is what Hibernate _reactive_ expects.
ja_jp: このメソッドはI/Oスレッドで実行されます。これはHibernate _reactive_ が期待していることです。

source: This method uses the injected health check bean to verify it is returning the expected result
ja_jp: このメソッドは、注入されたヘルスチェック Bean を使用して、期待される結果を返していることを確認します。

source: This method will invalidate all entries from the `foo` and `bar` caches with a single call.
ja_jp: このメソッドは、一度の呼び出しで `foo` および `bar` キャッシュからのすべてのエントリーを無効にします。

source: This method would produce:
ja_jp: この方法では、以下が生成されます。

source: This might be useful if your API goes through a Gateway that needs a certain version.
ja_jp: これは、あなたのAPIが特定のバージョンを必要とするゲートウェイを経由する場合に便利です。

source: This mightily important feature needs no introduction and has already been mentioned in the <<architectural-differences, architectural differences>> section.
ja_jp: この非常に重要な機能は紹介するまでもなく、すでに <<architectural-differences, アーキテクチャの差異>> セクションで述べたとおりです。

source: This mightily important feature needs no introduction and has already been mentioned in the <<architectural-differences,architectural differences>> section.
ja_jp: この非常に重要な機能は、紹介するまでもなく、 xref:architectural-differences[アーキテクチャの違い] のセクションですでに述べたとおりです。

source: This mightily important feature needs no introduction and has already been mentioned in the xref:architectural-differences[architectural differences] section.
ja_jp: この非常に重要な機能は、紹介するまでもなく、 xref:architectural-differences[アーキテクチャーの差異] セクションですでに述べたとおりです。

source: This mode is not compatible with the MicroProfile Fault Tolerance specification, albeit the incompatibility is very small. To restore full compatibility, add this configuration property:
ja_jp: このモードは、非互換性は非常に小さいものの、MicroProfile Fault Tolerance仕様と互換性がありません。 完全な互換性を回復するには、このコンフィギュレーションプロパティを追加してください。 :

source: This model enables the usage of a single IO thread to handle multiple requests. There are three significant benefits.
ja_jp: このモデルでは、単一の IO スレッドを使用して複数のリクエストを処理することができます。3 つの大きなメリットがあります。

source: This model is much more efficient, but we need a way to write code to express these continuations.
ja_jp: このモデルははるかに効率的ですが、これらの継続性を表現するためのコードを書く方法が必要です。

source: This model should consist of:
ja_jp: このモデルは以下のように構成されているはずです:

source: This monopolization can lead to the creation of new carrier threads to execute other virtual threads. Creating carrier threads results in creating platform threads. So, there is a memory cost associated with this creation.
ja_jp: この独占は、他の仮想スレッドを実行するために新しいキャリアースレッドを作成することにつながります。 キャリアースレッドを作成すると、プラットフォームスレッドを作成することになります。 そのため、この作成にはメモリーコストがかかります。

source: This multi-stage Docker build copies the Maven wrapper from the host machine. The Maven wrapper (or the Gradle wrapper) is a convenient way to provide a specific version of Maven/Gradle. It avoids having to create a base image with Maven and Gradle. To provision the Maven Wrapper in your project, use: `mvn -N org.apache.maven.plugins:maven-wrapper-plugin:3.1.0:wrapper`.
ja_jp: このマルチステージ Docker ビルドは、ホストマシンから Maven ラッパーをコピーします。Maven ラッパー (または Gradle ラッパー) は、特定のバージョンの Maven/Gradle を提供するための便利な方法です。Maven と Gradle を使用してベースイメージを作成する必要がなくなります。プロジェクトで Maven ラッパーをプロビジョニングするには、 `mvn -N org.apache.maven.plugins:maven-wrapper-plugin:3.1.0:wrapper` を使用します。

source: This multi-stage Docker build copies the Maven wrapper from the host machine. The Maven wrapper (or the Gradle wrapper) is a convenient way to provide a specific version of Maven/Gradle. It avoids having to create a base image with Maven and Gradle. To provision the Maven Wrapper in your project, use: `mvn -N org.apache.maven.plugins:maven-wrapper-plugin:3.1.1:wrapper`.
ja_jp: このマルチステージDockerビルドは、ホストマシンからMavenラッパーをコピーします。Mavenラッパー（またはGradleラッパー）は、Maven/Gradleの特定のバージョンを提供する便利な方法です。それは、MavenとGradleでベースイメージを作成することを避けることができます。プロジェクトでMavenラッパーをプロビジョニングするには、次のようにします： `mvn -N org.apache.maven.plugins:maven-wrapper-plugin:3.1.1:wrapper` .

source: This multi-stage Docker build copies the Maven wrapper from the host machine. The Maven wrapper (or the Gradle wrapper) is a convenient way to provide a specific version of Maven/Gradle. It avoids having to create a base image with Maven and Gradle. To provision the Maven Wrapper in your project, use: `mvn wrapper:wrapper`.
ja_jp: このマルチステージ Docker ビルドは、ホストマシンから Maven ラッパーをコピーします。 Maven ラッパー (または Gradle ラッパー) は、特定のバージョンの Maven/Gradle を提供するための便利な方法です。 これにより、Maven と Gradle を使用してベースイメージを作成する必要がなくなります。 プロジェクトで Maven ラッパーをプロビジョニングするには、 `mvn wrapper:wrapper` を使用します。

source: This native build will take some time on first run but any subsequent runs (without changing `quarkusapp.java`) will be close to instant thanks to JBang cache:
ja_jp: このネイティブビルドは最初の実行には時間がかかりますが、その後は (`quarkusapp.java` を変更せずに) jbang キャッシュのおかげですぐに実行できるようになります。

source: This new endpoint will be located at /secured/roles-allowed
ja_jp: この新しいエンドポイントは /secured/roles-allowed に存在します。

source: This new endpoint will be located at `/secured/roles-allowed`
ja_jp: この新しいエンドポイントは `/secured/roles-allowed` に配置されます

source: This new feature is explained in detail in the https://quarkus.io/guides/stork-registration[Automatic service registration with SmallRye Stork for Quarkus] guide.
ja_jp: この新機能は、 https://quarkus.io/guides/stork-registration[Quarkus 用 SmallRye Stork による自動サービス登録]ガイドで詳しく説明されています。

source: This observer consumes all the `AuthenticationSuccessEvent` events asynchronously, which means that HTTP request processing will continue regardless on the event processing. Depending on the application, that can be a lot of the `AuthenticationSuccessEvent` events. For that reason, asynchronous processing can have positive effect on performance.
ja_jp: このオブザーバーはすべての `AuthenticationSuccessEvent` イベントを非同期に消費します。つまり、HTTP リクエスト処理はイベント処理に関係なく継続されます。 アプリケーションによっては、 `AuthenticationSuccessEvent` イベントは大量になります。 そのため、非同期処理はパフォーマンスに良い影響を与えます。

source: This one is easy: whenever you generate a `UUID`, the JDK will initialize a `SecureRandom` instance. And initializing a `SecureRandom` instance doesn't come for free, oh no.
ja_jp: これは単純明快です。 `UUID` を生成するたびに、JDK は `SecureRandom` インスタンスを初期化します。そして、 `SecureRandom` インスタンスの初期化は、決してタダではありません。

source: This one isn't new to us: one of the reasons we wrote Quarkus in the first place was to avoid reading annotations at runtime.
ja_jp: これは私たちにとって新しいことではありません。そもそも Quarkus を作成した理由の 1 つは、実行時のアノテーションの読み込みを避けることでした。

source: This only has impact on extension developers who should switch to the new plugin.
ja_jp: これは、エクステンションの開発者にのみ影響があり、新しいプラグインに切り替えていただく必要があります。

source: This only registers the implementation classes for instantiation via reflection (you will not be able to inspect its fields and methods). If you need to do that, you can do it this way:
ja_jp: これは、リフレクションを介したインスタンス化のために実装クラスのみを登録しますす (フィールドやメソッドは検査できません)。これを行う必要がある場合は、以下を実行してください。

source: This only works when your application is running inside a Google Cloud managed runtime like App Engine.
ja_jp: これは、アプリケーションがApp EngineなどのGoogle Cloudマネージドランタイム内で実行されている場合にのみ機能します。

source: This option is only available when using the Quarkus REST Quarkus extension.
ja_jp: このオプションは、Quarkus REST Quarkusエクステンションを使用している場合にのみ使用できます。

source: This option is only available when using the RESTEasy Reactive Quarkus extension.
ja_jp: このオプションは、RESTEasy Reactive Quarkusエクステンションを使用している場合にのみ使用できます。

source: This option was introduced in 3.26.0 and will be evolving in the upcoming releases.
ja_jp: このオプションは 3.26.0 で導入され、今後のリリースで進化していく予定です。

source: This packaging performs very well in the traditional JVM world, but it doesn't play nicely with Project Leyden.
ja_jp: このパッケージングは従来の JVM 環境では非常に優れたパフォーマンスを発揮しますが、Project Leyden とはうまく連携しません。

source: This page explains how to deploy your gRPC service in Quarkus in Kubernetes. We'll continue with the example from xref:grpc-getting-started.adoc[the Getting Started gRPC guide].
ja_jp: このページでは、Kubernetes の Quarkus に gRPC サービスをデプロイする方法について説明します。 引き続き xref:grpc-getting-started.adoc[gRPC スタートガイド] の例を使用します。
